brew 'openssl'
brew 'readline'

brew 'cmake'
brew 'gradle'

brew 'elixir-build'
brew 'erlang'
brew 'exenv'
brew 'lua'
brew 'nvm'
brew 'go'
brew 'gcc'
brew 'rbenv'
brew 'ruby-build'
brew 'yarn'

brew 'awscli'
brew 'awsebcli'
brew 'ctags'
brew 'flow'
brew 'fontforge'
brew 'fswatch'
brew 'heroku'
brew 'hub'
brew 'lv'
brew 'mas'
brew 'mysql'
brew 'packer'
brew 'peco'
brew 'qt@5.5'
brew 'terminal-notifier'
brew 'the_silver_searcher'
brew 'tig'
brew 'tree'
brew 'unison'
brew 'vim', args: ['with-lua']
brew 'wget'
brew 'watchman'

mas 'Alfred',     id: 405843582
mas 'feedly',     id: 865500966
mas 'Fotor',      id: 503039729
mas 'Keynote',    id: 409183694
mas 'OneNote',    id: 784801555
mas 'Opera',      id: 404764921
mas 'Pixelmator', id: 407963104
mas 'Slack',      id: 803453959
mas 'Twitter',    id: 409789998
mas 'Xcode',      id: 497799835

tap 'homebrew/dupes'
brew 'rsync'

tap 'caskroom/cask'

cask 'adobe-reader'
cask 'android-platform-tools'
cask 'android-sdk'
cask 'android-studio'
cask 'atom'
cask 'evernote'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'fluid'
cask 'gas-mask'
cask 'github-desktop'
cask 'googleappengine'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'google-drive'
cask 'google-japanese-ime'
cask 'google-web-designer'
cask 'iterm2'
cask 'java'
cask 'kindle'
cask 'libreoffice'
cask 'licecap'
cask 'mono-mdk'
cask 'mysqlworkbench'
cask 'postgres'
cask 'rstudio'
cask 'silverlight'
cask 'skype'
cask 'vagrant'
cask 'vagrant-manager'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'xamarin-studio'
cask 'xquartz'

tap 'caskroom/fonts'

cask 'font-inconsolata-dz-for-powerline'
