brew 'openssl'
brew 'readline'
brew 'libmagic'

brew 'cmake'

brew 'asdf'

brew 'go'
brew 'gcc'
brew 'lua'

brew 'awscli'
brew 'awsebcli'
brew 'cloud-sql-proxy'
brew 'ctags'
brew 'flow'
brew 'flyctl'
brew 'fontforge'
brew 'fswatch'
brew 'git-secrets'
brew 'gh'
brew 'gnu-sed'
brew 'gpg'
brew 'graphviz'
brew 'httping'
brew 'jq'
brew 'lv'
brew 'mas'
brew 'mecab'
brew 'mecab-ipadic'
brew 'mysql'
brew 'openapi-generator'
brew 'packer'
brew 'peco'
brew 'python-tk'
brew 'qt'
brew 'telnet'
brew 'terminal-notifier'
brew 'terraform'
brew 'the_silver_searcher'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'unison'
brew 'vim'
brew 'wget'
brew 'watchman'

mas 'feedly',            id: 865500966
mas 'Fotor',             id: 503039729
mas 'Keynote',           id: 409183694
mas 'Microsoft OneNote', id: 784801555
mas 'Pixelmator',        id: 407963104
mas 'Slack',             id: 803453959
mas 'ToDo',              id: 1274495053
mas 'Twitter',           id: 1482454543
mas 'WeChat',            id: 836500024
mas 'Xcode',             id: 497799835

tap 'cesanta/mos'

brew 'mos'

tap 'heroku/brew'

brew 'heroku'

cask 'alfred'
cask 'android-platform-tools'
cask 'android-ndk'
cask 'android-sdk'
cask 'android-studio'
cask 'arduino'
cask 'atom'
cask 'chromedriver'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'fluid'
cask 'gas-mask'
cask 'git-credential-manager'
cask 'googleappengine'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'google-drive'
cask 'intellij-idea-ce'
cask 'kindle'
cask 'licecap'
cask 'mysqlworkbench'
cask 'ngrok'
cask 'notion'
cask 'paw'
cask 'postgres-unofficial'
cask 'postman'
cask 'session-manager-plugin'
cask 'skype'
cask 'visual-studio-code'
cask 'xquartz'

brew 'gradle'

tap 'homebrew/cask-fonts'

cask 'font-inconsolata-dz-for-powerline'
cask 'font-myrica'

tap 'versent/homebrew-taps'

brew 'saml2aws'

tap 'fujiwara/tap'
brew 'tracer'
